const listOfMezmurs = [
  {
    id: "1",
    artist: "ዘማሪ ዲያቆን አቤል መክብብ",
    title: "ተመስገን",
    createdDate: "2021-09-01",
    duration: "3:43",
    isPlaying: false,
    url: "https://traffic.megaphone.fm/FODL8281657475.mp3?updated=1673441802",
    lyrics: `
    ለሁሉም ፀሐይ ቀን ምታወጣ
ድሃን አትንቅም ገንዘብ ስላጣ
ባይኖረው እንኳን ባንተ ይኖራል
ቆርሰህ ስትሰጠው ተመስገን ይላል::`
  },
  {
    id: "2",
    artist: "",
    title: "እሴብሕ ጸጋኪ",
    createdDate: "2021-09-01",
    duration: "5:01",
    isPlaying: false,
    url: "https://api.spreaker.com/download/episode/43447400/letteraoreste.mp3",
    lyrics: `
እሴብሕ ጸጋኪ ኦ እግዝእትየ ማርያም
ዕጽ ልምልምት ወፍሬ ጥዕምት /3/
ሐረገወይን /3/ አንቲ ማርያም
አጸደ ወይን /3/ አንቲ ማርያም
አዝ--------------//
ትመስሊ ፊደለ ወትወልዲ ወንጌለ
ወታገምሪ መስቀለ
አዝ--------------//
ትመስሊ ሰማየ ወትወልዲ ፀሐየ
ወታገምሪ አዶናየ
አዝ--------------//
ትመስሊ መሶበ ወትወልዲ ኮከበ
ወታጸግቢ ርኁበ
አዝ--------------//
ትመስሊ መቅደሰ ወትልዲ ንጉሠ
ወታገምሪ መንፈስ ቅዱሰ
አዝ--------------//
ትመስሊ ታቦተ ወትወልዲ ጽላተ
ወታገምሪ መለኮተ
አዝ--------------//
ትመስሊ ደመና ወትወልዲ ኀብሰተ መና
ወታገምሪ ጥዒና
አዝ--------------//
ትመስሊ ገራኅተ ወትፈርዪ ሰዊተ
ወታጸድቂ ነፍሳተ
አዝ--------------//
ትመስሊ ስኒነ ወትወልዲ መድኅነ
ወትፌውሲ ድውያነ
አዝ--------------//
ትመስሊ ምሥራቀ ወትወልዲ መብረቀ
ወታለብሲ ዕሩቀ
አዝ--------------//
ለአብ መርዓቱ ለወልድ ወላዲቱ
ለመንፈስ ቅዱስ ጽርሐ ቤቱ
እሴብሕ ጸጋኪ ኦ እግዝእትየ ማርያም
ዕጽ ልምልምት ወፍሬ ጥዕምት /3/
ሐረገወይን /3/ አንቲ ማርያም
አጸደ ወይን /3/ አንቲ ማርያም
አዝ--------------//
ትመስሊ ፊደለ ወትወልዲ ወንጌለ
ወታገምሪ መስቀለ
አዝ--------------//
ትመስሊ ሰማየ ወትወልዲ ፀሐየ
ወታገምሪ አዶናየ
አዝ--------------//
ትመስሊ መሶበ ወትወልዲ ኮከበ
ወታጸግቢ ርኁበ
አዝ--------------//
ትመስሊ መቅደሰ ወትልዲ ንጉሠ
ወታገምሪ መንፈስ ቅዱሰ
አዝ--------------//
ትመስሊ ታቦተ ወትወልዲ ጽላተ
ወታገምሪ መለኮተ
አዝ--------------//
ትመስሊ ደመና ወትወልዲ ኀብሰተ መና
ወታገምሪ ጥዒና
አዝ--------------//
ትመስሊ ገራኅተ ወትፈርዪ ሰዊተ
ወታጸድቂ ነፍሳተ
አዝ--------------//
ትመስሊ ስኒነ ወትወልዲ መድኅነ
ወትፌውሲ ድውያነ
አዝ--------------//
ትመስሊ ምሥራቀ ወትወልዲ መብረቀ
ወታለብሲ ዕሩቀ
አዝ--------------//
ለአብ መርዓቱ ለወልድ ወላዲቱ
ለመንፈስ ቅዱስ ጽርሐ ቤቱ`
  },
];

export default listOfMezmurs;