const listOfMezmurs = [
  {
    id: "1",
    artist: "የጥር 7 ወረብ",
    title: "ነአምን",
    createdDate: "2021-09-01",
    duration: "5:54",
    isPlaying: false,
    isLoading: false,
    url: "https://nexifytechnology.com/ነአምን.m4a",
    lyrics: `
    ነአምን በአብ ወነአምን በወልድ ወነአምን በመንፈስ ቅዱስ/2/
    አሐዱ ውእቱ አምላክ ፍፁም አሐዱ ውእቱ/2/
    `
  },
  {
    id: "2",
    artist: "",
    title: "እሴብሕ ጸጋኪ",
    createdDate: "2021-09-01",
    duration: "6:39",
    isPlaying: false,
    isLoading: false,
    url: "https://nexifytechnology.com/እሴብሕ ጸጋኪ.m4a",
    lyrics: `
እሴብሕ ጸጋኪ ኦ እግዝእትየ ማርያም
ዕጽ ልምልምት ወፍሬ ጥዕምት /3/
ሐረገወይን /3/ አንቲ ማርያም
አጸደ ወይን /3/ አንቲ ማርያም
አዝ--------------//
ትመስሊ ፊደለ ወትወልዲ ወንጌለ
ወታገምሪ መስቀለ
አዝ--------------//
ትመስሊ ሰማየ ወትወልዲ ፀሐየ
ወታገምሪ አዶናየ
አዝ--------------//
ትመስሊ መሶበ ወትወልዲ ኮከበ
ወታጸግቢ ርኁበ
አዝ--------------//
ትመስሊ መቅደሰ ወትልዲ ንጉሠ
ወታገምሪ መንፈስ ቅዱሰ
አዝ--------------//
ትመስሊ ታቦተ ወትወልዲ ጽላተ
ወታገምሪ መለኮተ
አዝ--------------//
ትመስሊ ደመና ወትወልዲ ኀብሰተ መና
ወታገምሪ ጥዒና
አዝ--------------//
ትመስሊ ገራኅተ ወትፈርዪ ሰዊተ
ወታጸድቂ ነፍሳተ
አዝ--------------//
ትመስሊ ስኒነ ወትወልዲ መድኅነ
ወትፌውሲ ድውያነ
አዝ--------------//
ትመስሊ ምሥራቀ ወትወልዲ መብረቀ
ወታለብሲ ዕሩቀ
አዝ--------------//
ለአብ መርዓቱ ለወልድ ወላዲቱ
ለመንፈስ ቅዱስ ጽርሐ ቤቱ
እሴብሕ ጸጋኪ ኦ እግዝእትየ ማርያም
ዕጽ ልምልምት ወፍሬ ጥዕምት /3/
ሐረገወይን /3/ አንቲ ማርያም
አጸደ ወይን /3/ አንቲ ማርያም
አዝ--------------//
ትመስሊ ፊደለ ወትወልዲ ወንጌለ
ወታገምሪ መስቀለ
አዝ--------------//
ትመስሊ ሰማየ ወትወልዲ ፀሐየ
ወታገምሪ አዶናየ
አዝ--------------//
ትመስሊ መሶበ ወትወልዲ ኮከበ
ወታጸግቢ ርኁበ
አዝ--------------//
ትመስሊ መቅደሰ ወትልዲ ንጉሠ
ወታገምሪ መንፈስ ቅዱሰ
አዝ--------------//
ትመስሊ ታቦተ ወትወልዲ ጽላተ
ወታገምሪ መለኮተ
አዝ--------------//
ትመስሊ ደመና ወትወልዲ ኀብሰተ መና
ወታገምሪ ጥዒና
አዝ--------------//
ትመስሊ ገራኅተ ወትፈርዪ ሰዊተ
ወታጸድቂ ነፍሳተ
አዝ--------------//
ትመስሊ ስኒነ ወትወልዲ መድኅነ
ወትፌውሲ ድውያነ
አዝ--------------//
ትመስሊ ምሥራቀ ወትወልዲ መብረቀ
ወታለብሲ ዕሩቀ
አዝ--------------//
ለአብ መርዓቱ ለወልድ ወላዲቱ
ለመንፈስ ቅዱስ ጽርሐ ቤቱ`
  },
];

export default listOfMezmurs;